package Black_Belt.t_8_Multithreading.AsynchronousSynchronous;

/**
 * В синхронном программировании задачи выполняются
 * последовательно друг за другом.
 * ----- Синхрон -----
 * Писать 2 письма, снчала 1-е, потом 2-е - последовательно
 *
 * В асинхронном программировании каждая следующая
 * задача НЕ ждёт окончания выполнения предыдущей.
 * Асинхронное программирование помогает достичь concurrency.
 * ----- Асинхрон -----
 *  Готов бтур и стирать белье
 *  Можно делать по-частям чать первого, потом второго
 *  опять первого и т.д.
 */
public class AsynchronousSynchronous {
}
