package Задачи.zad_Alishev.Zad1;

/**
 * 1. Вывести на экран слово  “JAVA”, в строку, чтобы оно повторилось 10 раз, используя
 * цикл  while .
 * Вывод в консоль должен быть таким:
 * JAVA JAVA JAVA JAVA JAVA JAVA JAVA JAVA JAVA JAVA
 */
public class z1_1 {
    public static void main(String[] args) {
        int count = 0;
        while (count < 10) {
            System.out.println(count);
            count++;
        }
    }
}

