package Задачи.zad_Alishev.Zad1;
/**Повторить задание 1, но используя цикл  for .
 3. Вывести на экран слово  “JAVA” , в столбик, чтобы оно повторилось 10 раз,
 используя цикл на ваше усмотрение ( for или while ).
 Вывод в консоль должен быть таким:
 JAVA
 JAVA
 JAVA
 JAVA
 JAVA
 JAVA
 JAVA
 JAVA
 JAVA
 JAVA*/
public class z1_2 {
    public static void main(String[] args) {
       for (int i = 0; i <10;i++){
           System.out.println("JAVA");
        }
    }
}